app/controllers/places_controller.rb

  def index
   if user_signed_in?
    @places = Place.all
---
SELECT "places".* FROM "places"

  def create
    @place = Place.new(place_params)

    respond_to do |format|
      if @place.save
---
INSERT INTO "places" ("name", "latitude", "longitude", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "desert Algerie"], ["latitude", "21.520536"], ["longitude", "5.202994"], ["created_at", "2018-12-06 10:26:28.170050"], ["updated_at", "2018-12-06 10:26:28.170050"]]

  def destroy
    @place.destroy
---
DELETE FROM "places" WHERE "places"."id" = $1  [["id", 21]]

    def set_place
      @place = Place.find(params[:id])
---
SELECT  "places".* FROM "places" WHERE "places"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]